app/Controllers/Client/Dashboard.php

    public function index()
    {
        // Vérifier connexion
        if (!session()->get('is_logged_in')) {
            return redirect()->to('/');
        }

        $clientModel = new ClientModel();
        $client = $clientModel->find(session()->get('client_id'));
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 4