app/Controllers/Client/Depot.php

SELECT *
FROM `clients`
WHERE `clients`.`id` = 7
INSERT INTO `transactions` (`client_id`, `type`, `amount`, `fee`, `total`, `recipient`, `balance_before`, `balance_after`) VALUES (7, 'DEPOT', 100000, 0, 100000, NULL, 0, 100000)
---
    public function doDepot()
    {
        $amount = (float) $this->request->getPost('amount');

        if ($amount <= 0) {
            return redirect()->back()->with('error', 'Montant invalide');
        }

        $clientId = session()->get('client_id');
        $clientModel = new ClientModel();
        $client = $clientModel->find($clientId);

        $newBalance = $client['balance'] + $amount;

        // Mettre à jour solde
        $clientModel->updateBalance($clientId, $newBalance);

        // Enregistrer transaction
        $transactionModel = new TransactionModel();
        $transactionModel->insert([
            'client_id'      => $clientId,
            'type'           => 'DEPOT',
            'amount'         => $amount,
            'fee'            => 0,
            'total'          => $amount,
            'recipient'      => null,
            'balance_before' => $client['balance'],
            'balance_after'  => $newBalance
        ]);