app/Controllers/Client/Retrait.php

    public function doRetrait()
    {
        $amount = (float) $this->request->getPost('amount');

        if ($amount <= 0) {
            return redirect()->back()->with('error', 'Montant invalide');
        }

        $clientId = session()->get('client_id');
        $clientModel = new ClientModel();
        $client = $clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 2


        // Enregistrer transaction
        $transactionModel = new TransactionModel();
        $transactionModel->insert([
            'client_id'      => $clientId,
            'type'           => 'RETRAIT',
            'amount'         => $amount,
            'fee'            => $fee,
            'total'          => $total,
            'recipient'      => null,
            'balance_before' => $client['balance'],
            'balance_after'  => $newBalance
        ]);
---
INSERT INTO `transactions` (`client_id`, `type`, `amount`, `fee`, `total`, `recipient`, `balance_before`, `balance_after`) VALUES (2, 'RETRAIT', 1000, 100, 1100, NULL, 35000, 33900)