app/Controllers/Client/Transfert.php

    public function doTransfert()
    {
        $amount = (float) $this->request->getPost('amount');
        $recipients = $this->request->getPost('recipients'); // Tableau de numéros
        $includeWithdrawFee = $this->request->getPost('include_withdraw_fee') ? 1 : 0;

        if ($amount <= 0) {
            return redirect()->back()->with('error', 'Montant invalide');
        }

        if (empty($recipients) || !is_array($recipients)) {
            return redirect()->back()->with('error', 'Veuillez sélectionner au moins un destinataire');
        }

        // Filtrer les doublons et vides
        $recipients = array_unique(array_filter($recipients));

        if (empty($recipients)) {
            return redirect()->back()->with('error', 'Veuillez sélectionner au moins un destinataire');
        }

        $clientId = session()->get('client_id');
        $clientModel = new ClientModel();
        $client = $clientModel->find($clientId);
---
SELECT *
FROM `clients`
WHERE `clients`.`id` = 1


            // Commission si autre opérateur
            $prefix = substr($recipientPhone, 0, 3);
            $prefixInfo = $prefixModel->where('prefix', $prefix)->first();
---
SELECT *
FROM `prefixes`
WHERE `prefix` = '038'
 LIMIT 1


        // Créer la transaction principale
        $transactionModel = new TransactionModel();
        $transactionId = $transactionModel->insert([
            'client_id'            => $clientId,
            'type'                 => 'TRANSFERT',
            'amount'               => $amount,
            'fee'                  => $totalFee,
            'commission'           => $totalCommission,
            'total'                => $totalDebit,
            'recipient'            => implode(', ', $recipients),
            'include_withdraw_fee' => $includeWithdrawFee,
            'is_multiple'          => count($recipients) > 1 ? 1 : 0,
            'balance_before'       => $client['balance'],
            'balance_after'        => $newBalance
        ]);
---
INSERT INTO `transactions` (`client_id`, `type`, `amount`, `fee`, `commission`, `total`, `recipient`, `include_withdraw_fee`, `is_multiple`, `balance_before`, `balance_after`) VALUES (1, 'TRANSFERT', 3000, 400, 0, 3600, '0382222222, 0343333333', 1, 1, 50000, 46400)

            $recipientNewBalance = $recipient['balance'] + $amountPerRecipient;
            $clientModel->updateBalance($recipient['id'], $recipientNewBalance);

            $transactionRecipientModel->insert([
                'transaction_id'    => $transactionId,
                'recipient_phone'   => $recipientPhone,
                'amount'            => $amountPerRecipient
            ]);

            // Transaction DEPOT pour le destinataire
            $transactionModel->insert([
                'client_id'       => $recipient['id'],
                'type'            => 'DEPOT',
                'amount'          => $amountPerRecipient,
                'fee'             => 0,
                'commission'      => 0,
                'total'           => $amountPerRecipient,
                'recipient'       => null,
                'balance_before'  => $recipient['balance'],
                'balance_after'   => $recipientNewBalance
            ]);
---
INSERT INTO `transaction_recipients` (`transaction_id`, `recipient_phone`, `amount`) VALUES (1, '0382222222', 1500)
INSERT INTO `transactions` (`client_id`, `type`, `amount`, `fee`, `commission`, `total`, `recipient`, `balance_before`, `balance_after`) VALUES (2, 'DEPOT', 1500, 0, 0, 1500, NULL, 25000, 26500)