app/Controllers/Client/Transfert.php

        $transactionModel = new TransactionModel();

        // Transaction émetteur
        $transactionModel->insert([
            'client_id'      => $clientId,
            'type'           => 'TRANSFERT',
            'amount'         => $amount,
            'fee'            => $fee,
            'total'          => $total,
            'recipient'      => $recipientPhone,
            'balance_before' => $client['balance'],
            'balance_after'  => $newBalance
        ]);

        // Transaction destinataire (reçoit un dépôt)
        $transactionModel->insert([
            'client_id'      => $recipient['id'],
            'type'           => 'DEPOT',
            'amount'         => $amount,
            'fee'            => 0,
            'total'          => $amount,
            'recipient'      => null,
            'balance_before' => $recipient['balance'],
            'balance_after'  => $recipientNewBalance
        ]);
---
INSERT INTO `transactions` (`client_id`, `type`, `amount`, `fee`, `total`, `recipient`, `balance_before`, `balance_after`) VALUES (2, 'TRANSFERT', 2000, 200, 2200, '0331234567', 33900, 31700)
INSERT INTO `transactions` (`client_id`, `type`, `amount`, `fee`, `total`, `recipient`, `balance_before`, `balance_after`) VALUES (1, 'DEPOT', 2000, 0, 2000, NULL, 50000, 52000)