app/Controllers/Admin/Commissions.php

SELECT *
FROM `commissions`
SELECT *
FROM `prefixes`
WHERE `is_our_operator` = 0
GROUP BY `operator`
---
    public function index() {
        $commissionModel = new CommissionModel();
        $prefixModel = new PrefixModel();

        $data['commissions'] = $commissionModel->findAll();
        $data['active_page'] = 'commissions';

        // Récupérer les opérateurs qui ne sont pas les nôtres
        $data['other_operators'] = $prefixModel->where('is_our_operator', 0)
                                                ->groupBy('operator')
                                                ->findAll();