app/Controllers/Admin/Comptes.php

SELECT *
FROM `clients`
---
    public function index() {
        $model = new ClientModel();
        $data['clients'] = $model->findAll();