app/Controllers/Admin/Fees.php

    public function index() {
        $db = \Config\Database::connect();
        $data['fees'] = $db->table('fees')
                           ->select('fees.*, operations.name as op_name')
                           ->join('operations', 'operations.id = fees.operation_id')
                           ->get()->getResultArray();
---
SELECT `fees`.*, `operations`.`name` as `op_name`
FROM `fees`
JOIN `operations` ON `operations`.`id` = `fees`.`operation_id`