app/Controllers/Admin/Gains.php

SELECT SUM(`fee`) AS `fee`
FROM `transactions`
SELECT `type`, SUM(fee) as total
FROM `transactions`
GROUP BY `type`
SELECT SUM(`commission`) AS `commission`
FROM `transactions`
SELECT `p`.`operator`, SUM(transactions.amount) as total_envoye, SUM(transactions.commission) as commissions_generees
FROM `transactions`
JOIN `prefixes` `p` ON SUBSTR(transactions.recipient, 1, 3) = p.prefix
WHERE `p`.`is_our_operator` = 0
GROUP BY `p`.`operator`
---
    public function index()
    {
        $db = \Config\Database::connect();

        $data['active_page'] = 'gains';

        $data['gains_interne'] = $db->table('transactions')
                                    ->selectSum('fee')
                                    ->get()->getRow()->fee ?? 0;


        $data['gains_inter'] = $db->table('transactions')
                                  ->selectSum('commission')
                                  ->get()->getRow()->commission ?? 0;

        // Total global de tes gains
        $data['total_gains'] = $data['gains_interne'] + $data['gains_inter'];


        $data['montants_par_operateur'] = $db->table('transactions')
            ->select('p.operator, SUM(transactions.amount) as total_envoye, SUM(transactions.commission) as commissions_generees')
            ->join('prefixes p', 'SUBSTR(transactions.recipient, 1, 3) = p.prefix')
            ->where('p.is_our_operator', 0) // Uniquement les autres opérateurs
            ->groupBy('p.operator')
            ->get()->getResultArray();