app/Controllers/Admin/Prefixes.php

    public function index() {
        $model = new PrefixModel();
        $data['prefixes'] = $model->findAll();
---
SELECT *
FROM `prefixes`