app/Models/ClientModel.php

SELECT *
FROM `clients`
WHERE `phone` = '0382222222'
 LIMIT 1
---
    public function findByPhone($phone)
    {
        return $this->where('phone', $phone)->first();

UPDATE `clients` SET `balance` = 46400
WHERE `clients`.`id` IN (1)
---
    public function updateBalance($id, $newBalance)
    {
        return $this->update($id, ['balance' => $newBalance]);