app/Models/FeeModel.php

SELECT *
FROM `operations`
WHERE `code` = 'TRANSFERT'
 LIMIT 1
SELECT *
FROM `fees`
WHERE `operation_id` = 3
AND `min_amount` <= 1500
AND `max_amount` >= 1500
 LIMIT 1
---
    public function getFeeForAmount($operationCode, $amount)
    {
        $operationModel = new OperationModel();
        $operation = $operationModel->where('code', $operationCode)->first();

        if (!$operation) {
            return 0;
        }

        $fee = $this->where('operation_id', $operation['id'])
                    ->where('min_amount <=', $amount)
                    ->where('max_amount >=', $amount)
                    ->first();