app/Models/PrefixModel.php

    public function isValidPrefix($phone)
    {
        $prefix = substr($phone, 0, 3);
        return $this->where('prefix', $prefix)->first() !== null;
---
SELECT *
FROM `prefixes`
WHERE `prefix` = '038'
 LIMIT 1

    public function isOurOperator($phone)
    {
        $prefix = substr($phone, 0, 3);
        $result = $this->where('prefix', $prefix)
                       ->where('is_our_operator', 1)
                       ->first();
---
SELECT *
FROM `prefixes`
WHERE `prefix` = '034'
AND `is_our_operator` = 1
 LIMIT 1