app/Models/TransactionModel.php

    public function getByClient($clientId)
    {
        return $this->where('client_id', $clientId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();
---
SELECT *
FROM `transactions`
WHERE `client_id` = 2
ORDER BY `created_at` DESC